#+TITLE: Puzzles
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty

No help from me! Or brother Neff! Or any professor!
Other rando's ... sure.  Other students ... even bettar!

To get full "extra credit" you must fill out all four. 
Solutions and proofs are different.  Solving a puzzle like the bomb puzzle in a previous lab
is much different than proving it is impossible if we don't know if the bomb is heavier or lighter
with only 2 weights!

*** Proof
#+BEGIN_SRC elisp
(require 'cl)

(loop for i from 1 to 10 do (print "hello world"))

 (print "hello world")
#+END_SRC

#+RESULTS:
: hello world

*Why does this not want to work*jj
#+BEGIN_SRC elisp
(require 'cl) ;; <-- this is necessary, as loop is defined in the cl package

(loop for n from 1 to 9
      do (princ (format "%d --> %d.\n"
                        n
                        ((lambda (n) (if (evenp n) (/ n 2) (+ 1 (* 3 n))))
                         n))))
#+END_SRC

#+RESULTS:

** DONE TME
   CLOSED: [2018-05-11 Fri 20:33]
   :LOGBOOK:
   CLOCK: [2018-05-11 Fri 20:00]--[2018-05-11 Fri 20:33] =>  0:33
   :END:
  Sequences can be non-numeric as well. What is the pattern for this sequence?
: [m b w y me be wi yo met bew ith you meta bewi thyo uati metap bewit hyoua tirel]
  How long can it continue?
